[
    {
      "title": "Джуниор Frontend-разработчик",
      "description": "Кому подходит программа «Джуниор»: Хочет стать разработчиком с нуля Вы еще не писали код, но готовы учиться так, чтобы в знаниях сразу обойти конкурентов, не стоять в очереди на вакансии и успешно устроиться на работу. Самостоятельно учился кодить Вы готовы индивидуально поработать с наставником, чтобы улучшить свои знания.А также постоянно быть на связи с человеком, который передаст свой опыт и предостережет от ошибок. Работает в смежной IT - области Вы хотите понимать, о чем говорят коллеги, или расширить свой функционал, чтобы получить более высокую должность и увеличить свой доход. Как проходит обучение в Result University Учитесь и практикуетесь На платформе материалы разделены по неделям, чтобы нагрузка ложилась равномерно. Общаетесь в чате В нем будете вы, одногруппники и наставник, который останется с вами до конца обучения. Созваниваетесь с группой Личные и групповые созвоны с наставником, с ответами на все ваши вопросы. Участвуете в хакатонах В команде разработаете плагин контекстного меню на JS и сайт команды на React. Кодите онлайн Почувствуете себя настоящим разработчиком на мастер - классах в реальном времени. Пишете дипломный проект В конце сделаете большую дипломную работу в портфолио с frontend и backend - частью. "
    },
    {
      "title": "Профессия Мидл Frontend-разработчик",
      "description": "Junior-разработчикам, которые хотят повысить свой грейд Вы уже знаете CSS, HTML, JavaScript и основы React, а также понимаете, как работает frontend - разработчик, и имеете небольшой опыт кодинга. Хотите расширить свой стек и вырасти до middle - разработчика.Шаг 1 Технические навыки Получаете полноценный набор знаний в программировании, чтобы стать middle на рынке frontend - разработки. Вы идете по структурированной и выверенной программе, благодаря чему чего к концу обучения получаете заветный грейд и опыт разработки на уровне middle. TypeScript + React + Git + StateManager CI / CD SSR MobX Next.js microfrontend DevOps tree shaking Testing Scrum chunks unit test Node.js JavaScript + MongoDB Docker Redux DOM Webpack + Redux Toolkit API JSX RRDv6 React Hooks SOLID ООП ES6 Шаг 2 Практика и командные проекты Зарабатываете свой грейд с опытом при помощи практических заданий и в командных проектах. На курсе вас ждет 8 работ, включая итоговую практику, Вы отработаете полученные знания сразу после освоения теоретической базы. Шаг 3 Soft skills и трудоустройство Бесконфликтная коммуникация, работа в команде, юридические вопросы— все это увеличивает ваши шансы при трудоустройстве. В конце обучения вы уделите внимание поиску работы и тонкостям трудоустройства на должность middle. "
    },
    {
      "title": "TypeScript научитесь всему, что нужно знать Middle",
      "description": "Курс подойдет, если вы Изучили JavaScript и хотите двигаться дальше, становясь более востребованным программистом. Хотите понять, в чем же сила системы типов и почему TS так популярен Хотите не только добавить новый навык в копилку, но и основательно его освоить. Стремитесь работать в сложных и интересных проектах с большой командой.Что вы получите на курсе ? 53 урока в HD Все уроки записаны понятным, человеческим языком, с примерами применения и анализом кода в высоком качестве, с хорошим звуком. Теория За 14 дней вы изучите исчерпывающий объем информации о TypeScript, который необходим каждому разработчику уровня мидл. Практика Вы выполните задания и тесты, которые помогут вам закрепить изученный материал.Вариант решения откроется автоматически после сдачи Закрытый чат Вы сможете задавать вопросы напрямую наставнику, а также получите бессрочный доступ к сообществу единомышленников Служба заботы Если у вас возникнут сложности, вы всегда сможете обратиться в отдел заботы, и мы найдем решение. Комфортное обучение Можно выбрать любую скорость обучения которая удобна вам.Структурированные материалы всегда у вас под рукой. "
    },
    {
      "title": "Самостоятельно учился кодить",
      "description": "Вы готовы индивидуально поработать с наставником, чтобы улучшить свои знания. А также постоянно быть на связи с человеком, который передаст свой опыт и предостережет от ошибок."
    },
    {
      "title": "Работает в смежной IT-области",
      "description": "Вы хотите понимать, о чем говорят коллеги, или расширить свой функционал, чтобы получить более высокую должность и увеличить свой доход."
    },
    {
      "title": "Git Advanced",
      "description": "Маленький и быстрый В Git операции выполняются локально, без подключения к удаленному серверу.Это позволяет работать с Git, даже когда есть проблемы со связью. Ветви и слияние Git позволяет использовать несколько независимых друг от друга веток— альтернативных копий основного репозитория.Можно безопасно менять код за пару секунд, не затрагивая основную кодовую базу. Распределение Вы не проверяете текущий фрагмент исходного кода, а полностью клонируете весь репозиторий.Если данные с сервера пропадут, проект сохранится в локальной копии.Курс подойдет вам, если вы 1. Слышали про Git: Понимаете, что Git— необходимый инструмент разработчика в любой работе:     в крупной компании; амбициозном стартапе; на личным проектом. Хотите с нуля научиться работе в Git и обрести уверенность в своих знаниях. 2. Ежедневно используете Git в своей работе: И хотите:     лучше понимать, как этот инструмент работает; уверенно использовать его; освоить на продвинутом уровне и применять на сложных проектах— сделать еще один шаг к позиции middle.Что вы получите на курсе ? Результат Освоите технологию Git на уровне middle и научитесь применять ее, чтобы упрощать работу над своими проектами и в команде. Материал курса В программе собраны все необходимые темы по Git, а также практические задания для закрепления знаний. Задания разной сложности Вы разберете несколько практических проектов, включая задание« со звездочкой» даже для уровня мидл. Закрытый чат На протяжении 12 месяцев вы сможете задавать вопросы напрямую кураторам в чате, где они подробно ответят на ваш вопрос. Служба заботы Если возникнут сложности, вы всегда сможете обратиться в отдел заботы, и мы найдем решение. Комфортное обучение Вы можете выбрать удобную скорость обучения.Структурированные материалы всегда под рукой. "
    },
    {
      "title": "Redux, Redux Toolkit и МоbX",
      "description": "Курс подойдет, если вы Хотите освоить технологию с нуля Вы уже работаете в компании или на стартапе, но ощущаете нехватку знаний по части State Managers. Хотите быстро научиться, чтобы улучшить качество своего кода. Стремитесь к уровню middle Вы уже освоили JavaScript и основы React и готовы заниматься более глобальными проектами. Хотите научиться использовать State Managers для собственных проектов и уменьшить количество ошибок в работе приложений.Уже изучали Redux, RTK и MobX Вы владеете навыками junior frontend - разработчика, в том числе основами State Managers. Хотите погрузиться в тему более основательно и за счет этого поднять свой грейд до уровня middle.Что вы получите на курсе ? Результат Освоите технологии State Managers на уровне middle и научитесь применять их, чтобы упростить работу над своими проектами и в команде. Материал курса В программе собраны все необходимые темы по части Redux + Redux Toolkit + MobX, а также практические задания для закрепления знаний. Углубленная практика Вы разберете несколько практических заданий для каждой технологии и получите обратную связь от куратора на платформе. Закрытый чат На протяжении месяца сможете общаться напрямую с кураторами в чате, где они подробно ответят на ваши вопросы. Служба заботы Если у вас возникнут сложности, вы всегда сможете обратиться в отдел заботы, и мы найдем решение. Комфортное обучение Можно выбрать любую скорость обучения, которая удобна вам.Структурированные материалы всегда у вас под рукой. "
    },
    {
      "title": "React Advanced",
      "description": "Курс подойдет, если вы хотите Наконец освоить React Вам не хвататет времени из - за работы, чтобы сесть и разобраться в технологии самостоятельно.С наставником это сделать быстрее и проще. Понять тонкости библиотеки Вы скупили тонну книжек и пересмотрели кучу видео, но так и не смогли понять, каким образом на React строятся действительно сложные и крупные приложения. Узнать, что такое React на практике Вы понимаете, что такое React в теории, но еще не выпускали ничего в продакшен.На курсе уделите отдельное внимание своему React - приложению.Чему вы научитесь на курсе ? React JavaScript - библиотека, с помощью которой разработчики создают интерфейсы.Лидирует как самая популярная JavaScript - технология в этой области. Другие инструменты пользуются меньшим спросом : Angular— 20, 4 % , Vue.js— 18, 8 % , Svelte— 4, 6 % . Хуки В React есть множество встроенных хуков, и разработчики также могут создавать собственные, чтобы переиспользовать логику между компонентами, делая код более модульным и облегчая его поддержку и расширение. Оптимизация React имеет обширные возможности для улучшения производительности приложений, такие как ленивая загрузка компонентов, мемоизация и многое другое. PWA(Progressive Web App) Могут быть созданы с использованием различных технологий и фреймворков для веб - разработки, включая React.Благодаря этому пользователи получают опыт, как в нативных приложениях. "
    },
    {
      "title": "React-разработчик",
      "description": "Актуальность В сравнение с другими подобными технологиями, React обновляется гораздо чаще.Новые обновления выходят каждые 2 - 3 месяца. Универсальность React не навязывает архитектуру приложения.Разработчик может реализовать любую свою идею, воспользовавшись вариантами решений, которые уже придумали другие React - разработчики до него. Сообщество Вокруг React выстроено большое комьюнити.На сегодня React - разработчики опубликовали решения для большинства задач, которые могут появиться в ходе работы над приложениями.Кому и зачем нужно знать React ? Если вы умеете работать с React, вам будет проще устроиться на работу и освоить любой другой фреймворк. Уже знаете HTML, CSS, JS и Git Вы получили базовые знания во frontend - разработке и хотите продолжить обучение, чтобы стать разработчиком интерфейсов. Начали учить React самостоятельно Вы уже знаете что - то по части React, но хотите глубже погрузиться во все тонкости и научиться применять технологию на практике. Хотите освоить еще один фреймворк Вы уже работали с другими фреймворками и хотите освоить React, чтобы расширить свой стек и получить доступ к большему количеству вакансий. "
    },
    {
      "title": "Курс по верстке с нуля до продвинутого уровня",
      "description": "Вам подходит обучение, если вы: Только начинаете свой путь в IT Вы хотите развиваться в веб - разработке.Навык верстки позволит вам избавиться от страха писать код и более плавно влиться в профессию. Иконка специалистов Junior frontend - разработчик Вы уже стали джуниором, но еще не владеете версткой на уверенном уровне.Хотите уметь собирать сайты как профи, чтобы не учиться этому на работе и сразу расти в профессии. Иконка специалистов Работаете веб - дизайнером или разработчиком на Tilda Вы хотите повысить стоимость работы за счет дополнительных навыков.С версткой вы сможете предлагать комплексные услуги, за которые платят больше.Изучите HTML и CSS с нуля до продвинутого уровня Вы поймете, как создавать блоки на сайтах, добавлять картинки, кнопки, настраивать шрифты и анимации. Освоите адаптивную верстку Узнаете, как настроить веб - страницу так, чтобы она гармонично смотрелась на мониторе компьютера и экране телефона. Научитесь верстать сайты под любой браузер Веб - страницы могут выглядеть по - разному в зависимости от браузера.На курсе вы узнаете, как написать сайт так, чтобы он везде открывался одинаково. Поймете, как упростить работу с кодом Научитесь автоматизировать процессы с помощью Gulp и структурировать код— с Sass. "
    },
    {
      "title": "Бесплатный онлайн-курс «Основы JavaScript» и 50 задач",
      "description": "Курс подойдет, если вы Новичок Научитесь всем базовым темам JavaScript, даже если ранее вы никогда не кодили на этом языке программирования, и потренируетесь на практике Самоучка Узнаете основную информацию по JavaScript в правильном порядке и сможете закрыть« пробелы» в знаниях Разработчик с опытом Даже если вы уже работаете в IT, повторите основы и проверите свои навыки в практических заданиях Что вы получите на курсе ? Основы JavaScript за 7 часов Вы освоите все важные темы по JavaScript за один присест, потому что мы собрали все основы в одном полноценном видео Проверенная программа Вы изучите актуальную информацию по JavaScript в правильном порядке.Материалы курса подготовил практикующий senior - разработчик 50 заданий по JavaScript Вы разберете ряд заданий, следуя от простых проектов к сложным, и сразу закрепите изученный материал на практике Чат с наставником Вам откроется доступ в чат, где вы сможете задавать вопросы напрямую наставнику в чате и общаться с другими студентами Автопроверка Вы сможете сразу перейти к следующему уроку, так как ваши ответы на задания к курсу принимаются автоматически Комфортное обучение Можно выбрать любую скорость обучения, которая удобна вам.Структурированные материалы всегда у вас под рукой "
    },
    {
      "title": "Бесплатный курс по HTML и CSS: обучение для начинающих во frontend ",
      "description": "Курс подойдет тем, кто Ищет себя и пробует новое Вы хотите узнать, каково быть разработчиком, и понять нравится ли вам это направление.Обучение покажет, что IT проще, чем кажется. Хочет стать frontend - разработчиком Вы решили стать программистом, но не знаете, с чего начать.На курсе получите базовые технологии frontend без лишней информации. Научиться верстать сайты Вы умеете делать прототипы и собирать сайты в конструкторах, но хотите добавить больше функциональности в свои проекты. "
    },
    {
      "title": "Бесплатный онлайн-марафон по JavaScript в игровом формате",
      "description": "Марафон подойдет тем, кто хочет Узнать больше о frontend - разработке Вы считаете, что лучше сразу идти в бой и начать с практики.Вы уже знаете HTML и CSS и теперь хотите освоить JavaScript. Освоить новые функции JavaScript Вы уже кодили на JS, но теперь хотите расширить свои знания в этой сфере и сразу применить их на практике. Расширить свое портфолио Ранее вы уделяли больше времени теории, а сейчас хотите создать проекты, чтобы пополнить портфолио или начать его с нуля.За 5 дней вы выполните 5 проектов Наставник проверит ваши работы и даст обратную связь, чтобы к концу обучения у вас было готовое портфолио. День 1— Плагин для картинок Создадим анимированный плагин раскрывающихся карточек.Его можно использовать в интернет - магазине, чтобы показывать товары. Стоимость услуги на фрилансе от 500 до 5 000₽. День 2— Таск - трекер Научимся делать инструмент Drag & Drop и создадим мини - приложение по типу Trello.Проект позволит реализовать функцию перетаскивания товаров в корзину и поможет в создании трекеров. Стоимость услуги на фрилансе от 2 000 до 10 000₽. День 3— Слайд - шоу Напишем анимированный слайдер для изображений, который можно использовать для презентации услуг, товаров и фотографий. Стоимость услуги на фрилансе от 3 500 до 15 000₽. День 4— Мини - игра Создадим визуальную мини - игру с динамической генерацией контента.Вы освоите динамическую генерацию и поймете, как оптимизировать работу с JS. Стоимость услуги на фрилансе от 4 000 до 20 000₽. День 5— Поймай точку Напишем свою игру Catch the Dot с тремя экранами!Поработаем с анимацией, таймером и функционалом полноценной игры Стоимость услуги на фрилансе от 5 000 до 25 000₽. "
    }
  ]